{"newspapers": {"infowars": {"rss": "https://www.infowars.com/feed/custom_feed_rss", "link": "https://www.infowars.com/", "articles": [{"link": "https://www.infowars.com/watch-live-lockdown-masks-vaccines-continue-as-dems-repubs-loot-middle-class/", "published": "2020-08-28T13:13:33", "title": "Watch Live: Lockdown, Masks & Vaccines Continue As Dems & Repubs Loot Middle Class", "text": "On this Friday broadcast of The David Knight Show, we’ll look at the continued government lockdown of America in the name of COVID-19 as the 2020 election approaches.\n\nThe Everyday Essentials Sale is now live! Get FREE SHIPPING storewide!"}, {"link": "https://www.infowars.com/cnn-political-analyst-claims-theres-very-little-rioting/", "published": "2020-08-28T12:11:38", "title": "CNN Political Analyst Claims “There’s Very Little Rioting”", "text": "CNN political analyst Kirsten Powers reacted to President Trump’s RNC speech last night by absurdly claiming “there’s very little rioting.”\n\nYes, really.\n\n“Let’s be honest Don and you do make this point over and over,” said Powers, addressing host Don Lemon.\n\n“There’s very little rioting, actually there’s very little violence, but it’s magnified by Donald Trump and it’s magnified by Republicans to convince people that people are coming for them and that’s just simply not what’s happening,” said Powers.\n\nIn reality, as anyone with eyes would know, the last three months have seen relentless rioting and violence in numerous American cities on a nightly basis.\n\nAs an illustration, last night was the first time there hasn’t been a riot in Portland in a full 93 days.\n\nIt looks like there was no late-night violent protest or riot in Portland for the first time in 93 days. Something is off. Antifa wouldn't just stop. Could it because they're terrified after hearing that @FBIPortland is stepping up its investigations? pic.twitter.com/q11wemPtPH — Andy Ngô (@MrAndyNgo) August 28, 2020\n\nIn addition to hundreds or even thousands of injuries suffered by both police and rioters, there have been dozens of deaths during the George Floyd riots (Wikipedia used to publish a regularly updated death toll but this was removed in recent weeks).\n\nEven back in June, the cost from property damage from the George Floyd riots (there have been many more since) were estimated to be the “most expensive civil disturbance(s) in US history,” according to experts, a figure that runs into the billions.\n\nMultiple videos also emerge every day showing anyone who gets in the way of the rioters or tries to defend their property being viciously beaten, or in the case of David Dorn, killed in cold blood.\n\nIt’s no surprise that CNN is burying the true extent of the riots given that their reporters are still describing them as “mostly peaceful” while towns and cities literally burn behind them.\n\nThe left’s effort to bury how widespread the riots really are is also predicated on the fact that polls and anecdotal evidence both clearly suggests the unrest is turning voters away from Joe Biden.\n\nSUBSCRIBE on YouTube:\n\nFollow on Twitter: Follow @PrisonPlanet\n\n———————————————————————————————————————\n\nALERT!\n\nIn the age of mass Silicon Valley censorship It is crucial that we stay in touch.\n\nI need you to sign up for my free newsletter here.\n\nAlso, I urgently need your financial support here.\n\n———————————————————————————————————————\n\nThe Everyday Essentials Sale is now live! Get up to 60% off the hottest items!"}, {"link": "https://www.infowars.com/man-accused-of-hate-crime-yelled-black-lives-matter-before-stabbing-white-victim/", "published": "2020-08-28T10:57:43", "title": "Man Accused of Hate Crime Yelled “Black Lives Matter” Before Stabbing White Victim", "text": "An African-American man yelled “black lives matter” before stabbing his white victim and now faces attempted 1st degree murder and hate crime charges, according to police in Aurora, Colorado.\n\nThe incident occurred on Tuesday night near East Alameda Avenue and South Sable Boulevard when 30-year-old Steve Sinclair approached 29-year-old Michael Conner and told him, “I’m going to kill you and your dog.”\n\nConner tried to run away and defend himself with a stick.\n\n“An arrest affidavit says Sinclair used a knife to stab 29-year-old Michael Conner who was transported to the hospital for his injuries and a collapsed lung,” reports 9News.\n\n“Conner, a white male, told police while at the hospital that Sinclair, a Black male, shouted “Black lives matter!” prior to stabbing him, according to the report.”\n\nAfter police arrived, Sinclair continued yelling “black lives matter” while also telling officers “I stabbed him, I’m a psychopath,” before refusing to sit down and insisting that officers shoot him.\n\nSinclair is being held at Arapahoe County Jail and faces charges of first-degree murder and bias-motivated crime.\n\nWe have highlighted several other attacks in recent weeks that were apparently motivated by Black Lives Matter rhetoric.\n\nNumerous vicious assaults have occurred at BLM protests, including in Kenosha, Wisconsin on Monday night when an elderly man was brutally assaulted after trying to protect his property from looters.\n\nAnother man in Portland was kicked in the head and knocked unconscious after trying to protect a person from being robbed.\n\nEarlier this week, a gang of three men fired shots from their vehicle at a group of Trump supporters during a political rally in Charlotte.\n\nLast week, a former city councilman who had a Trump/Pence sign in his yard was murdered in his home, although police claimed the killing was “random.”\n\nSUBSCRIBE on YouTube:\n\nFollow on Twitter: Follow @PrisonPlanet\n\n———————————————————————————————————————\n\nALERT!\n\nIn the age of mass Silicon Valley censorship It is crucial that we stay in touch.\n\nI need you to sign up for my free newsletter here.\n\nAlso, I urgently need your financial support here.\n\n———————————————————————————————————————\n\nThe Everyday Essentials Sale is now live! Get up to 60% off the hottest items!"}, {"link": "https://www.infowars.com/linguists-young-people-refusing-to-use-full-stops-in-sentences-because-they-see-them-as-aggressive/", "published": "2020-08-28T10:40:17", "title": "Linguists: Young People Refusing To Use Full Stops In Sentences Because They See Them As ‘Aggressive’", "text": "The world’s leading language experts have noted that young people are ‘fundamentally’ altering written communication based on what they perceive to be aggressive or offensive.\n\nIn particular, the use of the full stop, or period, in sentences is diminishing according to linguists because it has come to signify annoyance or offence.\n\n“Full stops are, in my experience, very much the exception and not the norm in [young people’s] instant messages, and have a new role in signifying an abrupt or angry tone of voice,” notes Owen McArdle, a linguist at the ­University of Cambridge.\n\nFellow linguist Dr Lauren Fonteyn of Leiden University said “If you send a text message without a full stop, it’s already obvious that you’ve concluded the message. So if you add that additional marker for completion, they will read something into it and it tends to be a falling intonation or negative tone.”\n\n\n\nMath? Whatever. It’s a sine of things to come. TikTok girl’s thoughts on math prove the theory that civilization is already dead. From British Museum to Mr. Bean, what made us civilized is being torn down (and we’re not talking about statues).\n\nProfessor David Crystal says that the period is perceived as “ominous” by younger people, particularly because the use of text messaging means that the end of sentences are becoming a thing of the past. Each one now has its own text message.\n\nThe professor claims that the full stop is no longer the end of a sentence, but is now an “emotion marker.”\n\n“You look at the internet or any instant messaging exchange – anything that is a fast dialogue taking place. People simply do not put full stops in, unless they want to make a point.” Crystal noted in his 2015 book Making a Point.\n\nCrystal points to a 2015 Binghamton University study that found college students perceive text messages ending in a full stop as being “less sincere” than those missing one.\n\nDuring the same study, researchers discovered that exclamation points had the opposite effect, making people seem more ‘sincere and engaged’.\n\nResearch leader Celia Klin noted in 2015 that “When speaking, people easily convey social and emotional information with eye gaze, facial expressions, tone of voice, pauses and so on. People obviously can’t use these mechanisms when they are texting. Thus, it makes sense that texters rely on what they have available to them – emoticons, deliberate misspellings that mimic speech sounds and, according to our data, punctuation.”\n\nThe gradual erosion of Language was predicted by George Orwell in his classic dystopia 1984.\n\nIn the novel, the all powerful Party mandates Newspeak, which focuses on diminishing vocabulary in order to control the range of thought among the general population.\n\nThe Everyday Essentials Sale is now live! Get up to 60% off the hottest items!"}]}, "breitbart": {"link": "https://www.breitbart.com/", "articles": []}, "theonion": {"link": "http://www.theonion.com/", "articles": []}}}